[    
    {
        "id": 1, 
        "name": "React Pandemic Board Game",
        "description": "Before the world had ever heard of COVID-19, there was a cooperative strategy game called Pandemic. As a real-life global pandemic raged on, I built my own app version of the popular game to practice writing custom objects, methods, and React components.",
        "tags": "React.js TailwindCSS OOP",
        "sourceLink": "https://github.com/kvaden19/react-pandemic",
        "deployedLink": "onequietnight.io"
    },
    {
        "id": 2,
        "name": "Select-4",
        "description": "An online lottery app created for a web development bootcamp group project. My role in this project was to handle everything data-related, from deciding how data would flow throughout the app to creating models in Sequelize to seeding the database. I also wrote RESTful APIs to allow connecting the database to the React front-end.",
        "tags": "React.js Sequelize RESTful_API",
        "sourceLink": "https://github.com/kvaden19/Select-4",
        "deployedLink": "#"
    },
    {
        "id": 3,
        "name": "React User Directory",
        "description": "This simple app was built as a proof-of-concept React app. It demos the functionality of a user directory but fetching a sample of profiles from the Random User API, and allowing for sorting and filtering of those users. It was refactored from a vanilla JS to a React app.",
        "tags": "React.js RandomUserAPI",
        "sourceLink": "https://github.com/kvaden19/react-user-directory",
        "deployedLink": "https://kvaden19.github.io/react-user-directory/"
    },
    {
        "id": 4,
        "name": "E-Commerce Back End",
        "description": "Data models and routes that could be used as a back-end for a small retail company. Data models allow for the creation of Categories, Products, and Tags. Routes allow the user to view, create, and edit Categories, Products, and Tags.",
        "tags": "Node.js Express.js Sequelize",
        "sourceLink": "https://github.com/kvaden19/e-commerce-back-end",
        "deployedLink": "https://drive.google.com/file/d/1mS8AQUFrLZuw20Rbe8YvfnY6XJh8hNmU/view"
    },
    {
        "id": 5,
        "name": "Weather Dashboard",
        "description": "A simple weather dashboard that allows a user to look up current and future weather conditions based on city name. The user's last ten searches will persist in local storage and be shown on the page.",
        "tags": "JavaScript jQuery OpenWeatherAPI Bootstrap HTML",
        "sourceLink": "https://github.com/kvaden19/weather-dashboard",
        "deployedLink": "https://kvaden19.github.io/weather-dashboard/"
    },
    {
        "id": 6,
        "name": "Password Generator",
        "description": "Best practices for web security tell us to use passwords that are hard to guess and to use a different password for each page or app we use. This app will generate a random password for the user, given criteria such as which character types to use and length of desired password",
        "tags": "JavaScript CSS HTML",
        "sourceLink": "https://github.com/kvaden19/password-generator",
        "deployedLink": "https://kvaden19.github.io/password-generator/"
    },
    {
        "id": 7,
        "name": "Fullstack Bet",
        "description": "An online hub for European Football information, including upcoming games and team stats. In this collaborative project, my role was to use JavaScript’s Fetch API and a third-party Soccer API to show the user stats on upcoming matches.",
        "tags": "FetchAPI SoccerAPI JavaScript CSS HTML",
        "sourceLink": "https://github.com/thereal-baitjet/bet-fullstack",
        "deployedLink": "https://thereal-baitjet.github.io/bet-fullstack/"
    }
]